In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
city="../copy_all_files_here/city_data.csv"
ride="../copy_all_files_here/ride_data.csv"

In [3]:
city_df=pd.read_csv(city)
ride_df=pd.read_csv(ride)

In [9]:
city_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [30]:
city_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [13]:
city_df

                city  driver_count   type
0        Richardfort            38  Urban
1       Williamsstad            59  Urban
2        Port Angela            67  Urban
3         Rodneyfort            34  Urban
4        West Robert            39  Urban
..               ...           ...    ...
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

[120 rows x 3 columns]

In [10]:
city_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [12]:
# Get the unique values of the type of city.
city_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [24]:
#That "unique()" method sucks, use value_counts() to get the unique items plus the number of times they are present
city_df['type'].value_counts()

Urban       66
Suburban    36
Rural       18
Name: type, dtype: int64

In [25]:
ride_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [31]:
ride_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [26]:
ride_df

                    city             date   fare       ride_id
0     Lake Jonathanshire  1/14/2019 10:14  13.83  5.739410e+12
1     South Michelleport   3/4/2019 18:24  30.24  2.343910e+12
2     Port Samanthamouth   2/24/2019 4:29  33.44  2.005070e+12
3             Rodneyfort  2/10/2019 23:22  23.44  5.149250e+12
4             South Jack    3/6/2019 4:28  34.58  3.908450e+12
...                  ...              ...    ...           ...
2370         Michaelberg  4/29/2019 17:04  13.38  8.550370e+12
2371     Lake Latoyabury   1/30/2019 0:05  20.76  9.018730e+12
2372         North Jaime  2/10/2019 21:03  11.11  2.781340e+12
2373        West Heather   5/7/2019 19:22  44.94  4.256850e+12
2374          Newtonview  4/25/2019 10:20  55.84  9.990580e+12

[2375 rows x 4 columns]

In [28]:
ride_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [29]:
# use value_counts() to get the unique items plus the number of times they are present
ride_df['city'].value_counts()

West Angela        39
South Karenland    38
North Jason        35
Port Frank         33
Liumouth           33
                   ..
Penaborough         5
Randallchester      5
South Saramouth     4
Newtonview          4
Garzaport           3
Name: city, Length: 120, dtype: int64

In [35]:
###MERGE DATAFRAMES
# Combine the data into a single dataset
df = pd.merge(ride_df, city_df, how="left", on=["city", "city"])

# Display the DataFrame
df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3.908450e+12,46,Urban